benchmarks/05-cache-hit.txt
GET /{code} with the cache on, one hot link so every read is a hit

Commit:   41fd1ec (working tree has uncommitted changes)
Date:     2026-09-04 14:15 IST
Machine:  Apple M5, 10 cores, macOS 26.6.2
Go:       go1.26.4
Postgres: 18.3 (Homebrew)
Rows:     500004

Method:   3s warm-up, then 5 runs of 10s at 50 concurrent,
          30 seconds between runs. Load generator, server and database all
          on this one machine.
Command:  hey -z 10s -c 50 -disable-redirects http://localhost:8080/seed250000

Results per run:

  run   req/s        p99
  1     43724        0.0015
  2     42888        0.0015
  3     42915        0.0015
  4     43021        0.0015
  5     43387        0.0015

  median   43021        0.0015
  slowest  42888        0.0015
  fastest  43724        0.0015

The median is the number to quote. The spread between fastest and slowest is
how much of a difference this machine produces on its own, so a change smaller
than that spread has not been shown to do anything.

--------------------------- raw output, run 1 ---------------------------


Summary:
  Total:	10.0007 secs
  Slowest:	0.0044 secs
  Fastest:	0.0001 secs
  Average:	0.0011 secs
  Requests/sec:	43724.0630
  
  Total data:	23612742 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [152]	|
  0.001 [31562]	|■■■
  0.001 [373804]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [31148]	|■■■
  0.002 [409]	|
  0.003 [63]	|
  0.003 [34]	|
  0.004 [33]	|
  0.004 [46]	|
  0.004 [21]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0011 secs
  75%% in 0.0012 secs
  90%% in 0.0013 secs
  95%% in 0.0014 secs
  99%% in 0.0015 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0028 secs
  resp wait:	0.0011 secs, 0.0001 secs, 0.0038 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0030 secs

Status code distribution:
  [302]	437273 responses



--------------------------- raw output, run 2 ---------------------------


Summary:
  Total:	10.0012 secs
  Slowest:	0.0065 secs
  Fastest:	0.0003 secs
  Average:	0.0012 secs
  Requests/sec:	42888.0543
  
  Total data:	23162328 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [14053]	|■
  0.002 [409200]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [5510]	|■
  0.003 [51]	|
  0.003 [17]	|
  0.004 [10]	|
  0.005 [40]	|
  0.005 [20]	|
  0.006 [16]	|
  0.007 [14]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0013 secs
  90%% in 0.0013 secs
  95%% in 0.0014 secs
  99%% in 0.0015 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0011 secs, 0.0002 secs, 0.0065 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [302]	428932 responses



--------------------------- raw output, run 3 ---------------------------


Summary:
  Total:	10.0009 secs
  Slowest:	0.0064 secs
  Fastest:	0.0003 secs
  Average:	0.0012 secs
  Requests/sec:	42914.8723
  
  Total data:	23176206 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [18746]	|■■
  0.002 [406546]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [3809]	|
  0.003 [37]	|
  0.003 [0]	|
  0.004 [0]	|
  0.005 [8]	|
  0.005 [14]	|
  0.006 [15]	|
  0.006 [13]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0012 secs
  90%% in 0.0013 secs
  95%% in 0.0014 secs
  99%% in 0.0015 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0036 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0011 secs, 0.0003 secs, 0.0027 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [302]	429189 responses



--------------------------- raw output, run 4 ---------------------------


Summary:
  Total:	10.0007 secs
  Slowest:	0.0061 secs
  Fastest:	0.0003 secs
  Average:	0.0012 secs
  Requests/sec:	43020.8199
  
  Total data:	23232906 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [10263]	|■
  0.001 [406139]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [13725]	|■
  0.003 [61]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [3]	|
  0.005 [14]	|
  0.005 [17]	|
  0.006 [16]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0012 secs
  90%% in 0.0013 secs
  95%% in 0.0014 secs
  99%% in 0.0015 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0039 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0011 secs, 0.0003 secs, 0.0024 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [302]	430239 responses



--------------------------- raw output, run 5 ---------------------------


Summary:
  Total:	10.0008 secs
  Slowest:	0.0061 secs
  Fastest:	0.0003 secs
  Average:	0.0012 secs
  Requests/sec:	43386.9244
  
  Total data:	23430870 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [18921]	|■■
  0.001 [406560]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [8235]	|■
  0.003 [62]	|
  0.003 [17]	|
  0.004 [10]	|
  0.004 [21]	|
  0.005 [23]	|
  0.006 [29]	|
  0.006 [26]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0012 secs
  90%% in 0.0013 secs
  95%% in 0.0014 secs
  99%% in 0.0015 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0040 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0011 secs, 0.0003 secs, 0.0060 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [302]	433905 responses